app/Controllers/DashboardController.php

SELECT *
FROM `users`
---
    public function index()
    {

        $validation = $this->validate([

            'email' => [
                'rules' => 'required|valid_email|is_not_unique[users.email]',
                'errors' => [
                    'required' => 'Email is must required',
                    'valid_email' => 'You must enter a valid email address',
                    'is_not_unique' => 'This email is not registered'
                ]
            ],
                'loginpswd' => [
                    'rules' => 'required|min_length[8]|max_length[55]',
                    'errors' => [
                        'required' => 'Password is must required',
                        'min_length' => 'At least 8 characters required',
                        'max_length' => 'Password maximum limit is 55 characters'
                    ]
                ],
            ]);
        if(!$validation){
            return view('forms/index2.php', ['validation' => $this->validator]);
        }
        else{
            $userModel = new UserModel();
            $all_users = $userModel->findAll();