app/Controllers/SignupController.php

    public function index()
    {
        $users = new UserModel();
        $username = isset($_POST['txt']) ? $_POST['txt'] : '';
        $email = isset($_POST['signemail']) ? $_POST['signemail'] : '';
        $password = isset($_POST['pswd']) ? $_POST['pswd'] : '';
        $password = isset($_POST['pswd']) ? $_POST['pswd'] : '';

        $password_hash = password_hash($password, PASSWORD_BCRYPT);
        $token = md5((string) $email);
        $db_data = [
            'username' => $username,
            'email' => $email,
            'password_hash' => $password_hash,
            'token' => $token
        ];
        $users->insert($db_data);
---
INSERT INTO `users` (`username`, `email`, `password_hash`, `token`) VALUES ('Shahmeer', 'shahmeerbinshazad@gmal.com', '$2y$10$xahuejysVBLk6CBDGKXdR.bHt46LrUXTTJD.E9qpQRvzaSXeRukOm', 'ce07df945d99c8103a21b1b93f66c3e1')